# задание 1 со звездой
dictionary = {
    "Имя": ["Андрей", "Кирилл", "Анна", "Евгений", "Евгений", "Александр", "Татьяна", "Аркадий", "Игорь", "Кирилл"],
     "Фамилия": ["Иванов", "Лазарев", "Петрова", "Надобников", "Никитин", "Иванов", "Никитина", "Лихачев", "Никитин", "Левашев"],
     "Город проживания": ["Москва", "Омск", "Псков", "Псков", "Москва", "Псков", "Москва", "Омск", "Псков", "Москва"],
     "Год рождения": [2000, 1987, 2003, 1993, 2001, 2001, 1976, 1957, 1969, 1999],
     "Месяц рождения": [6, 4, 11, 12, 9, 9, 5, 2, 3, 6],
     "Число рождения": [11, 25, 5, 3, 27, 31, 13, 12, 28, 24],
     "Статус": ["Студент", "Работает", "Школьница", "Работает", "Студент", "Студент", "Работает", "Пенсия", "Работает", "Студент"]
}
updated_dict = {
    "Фамилия Имя": [],
    "Дата рождения": [],
    "Город проживания": [],
    "Статус": []
}

for i in range(len(dictionary["Имя"])):
    name = dictionary["Имя"][i]
    surname = dictionary["Фамилия"][i]
    city = dictionary["Город проживания"][i]
    year = dictionary["Год рождения"][i]
    month = dictionary["Месяц рождения"][i]
    day = dictionary["Число рождения"][i]
    status = dictionary["Статус"][i]

    if name == "Кирилл":
        name = "Кириллл"

    if (surname == "Никитин" or surname == "Никитина") and city == "Москва":
        city = "Махачкала"

    if surname == "Иванов" and name == "Александр":
        status = "Работает"

    if surname == "Лихачев" and name == "Аркадий":
        continue

    full_name = f"{surname}--{name}"
    birth_date = f"{year}-{month}-{day}"
    updated_dict["Фамилия Имя"].append(full_name)
    updated_dict["Дата рождения"].append(birth_date)
    updated_dict["Город проживания"].append(city)
    updated_dict["Статус"].append(status)

for key, value in updated_dict.items():
    print(f"{key}: {value}")